superheroes/app/controllers/powers_controller.rb

SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        power = Power.find_by(id: params[:id])